In [78]:
import os

import numpy as np
import pandas as pd

In [2]:
#creating series from a list
ser1=pd.Series([10,20,30,40,50])
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
#creating series from an array
ser1=pd.Series(np.array([10.55,20,30,40,50]))
ser1

0    10.55
1    20.00
2    30.00
3    40.00
4    50.00
dtype: float64

In [4]:
ser2=pd.Series([10.55,20,30,40,50,"ASP",'GGWP','bruh'])
print(ser2,end='\n\n')

print("Value is-",ser2[3]+10.9)

0    10.55
1       20
2       30
3       40
4       50
5      ASP
6     GGWP
7     bruh
dtype: object

Value is- 50.9

In [5]:
ser3=pd.Series(["Meow",{'a':5,'b':6},"hmm","bruh"],index=[{'a',5,'t','t'},{'ok':5,'x':10},'e','e'])
ser3

{t, a, 5}                         Meow
{'ok': 5, 'x': 10}    {'a': 5, 'b': 6}
e                                  hmm
e                                 bruh
dtype: object

In [6]:
ser3['e']

e     hmm
e    bruh
dtype: object

In [7]:
print(ser3.index)
print(ser3.values)

Index([{'t', 'a', 5}, {'ok': 5, 'x': 10}, 'e', 'e'], dtype='object')
['Meow' {'a': 5, 'b': 6} 'hmm' 'bruh']

In [8]:
print(type(ser3.index))
print(type(ser3.values))

<class 'pandas.core.indexes.base.Index'>
<class 'numpy.ndarray'>

In [9]:
mydict={'A':'Plat','B':'Diamond','C':'Gold','D':'Plastic'}
print(mydict)

ser4=pd.Series(mydict)
ser4

{'A': 'Plat', 'B': 'Diamond', 'C': 'Gold', 'D': 'Plastic'}

A       Plat
B    Diamond
C       Gold
D    Plastic
dtype: object

In [10]:
ser4.index=['Lets','skip','series','module']

In [11]:
ser4

Lets         Plat
skip      Diamond
series       Gold
module    Plastic
dtype: object

In [12]:
#DATAFRAMES-

In [13]:
df=pd.DataFrame([['A',25,'BLR'],['B',35,'MUM'],['C',54,'DL'],['D',44,'CHN']])
df

   0   1    2
0  A  25  BLR
1  B  35  MUM
2  C  54   DL
3  D  44  CHN

In [14]:
#This method of collection of data is done when we take entire information from one individual and then the next one and so on.
df=pd.DataFrame([['A',25,'BLR'],['B',35,'MUM'],['C',54,'DL'],['D',44,'CHN']],columns=['Name','Age','Location'])
df

  Name  Age Location
0    A   25      BLR
1    B   35      MUM
2    C   54       DL
3    D   44      CHN

In [15]:
pl_info={'Name':['VK','SKY','MSD','KP'],'Score':[100,65,78,56],'Team':['RCB','MI','CSK','MI']}
pl_df=pd.DataFrame(pl_info)
pl_df

  Name  Score Team
0   VK    100  RCB
1  SKY     65   MI
2  MSD     78  CSK
3   KP     56   MI

In [16]:
new_df=pd.DataFrame([['SS',85,'RR'],['KL',99,'RCB']],columns=pl_df.columns)
new_df

  Name  Score Team
0   SS     85   RR
1   KL     99  RCB

In [17]:
my_df=pd.concat([pl_df,new_df]).reset_index(drop=True)
my_df

  Name  Score Team
0   VK    100  RCB
1  SKY     65   MI
2  MSD     78  CSK
3   KP     56   MI
4   SS     85   RR
5   KL     99  RCB

In [18]:
age=[36,33,42,38,34,30]

In [19]:
my_df['Age']=age

In [20]:
my_df

  Name  Score Team  Age
0   VK    100  RCB   36
1  SKY     65   MI   33
2  MSD     78  CSK   42
3   KP     56   MI   38
4   SS     85   RR   34
5   KL     99  RCB   30

In [21]:
my_df.head()

  Name  Score Team  Age
0   VK    100  RCB   36
1  SKY     65   MI   33
2  MSD     78  CSK   42
3   KP     56   MI   38
4   SS     85   RR   34

In [22]:
my_df.head(2)

  Name  Score Team  Age
0   VK    100  RCB   36
1  SKY     65   MI   33

In [23]:
my_df.tail(2)

  Name  Score Team  Age
4   SS     85   RR   34
5   KL     99  RCB   30

In [24]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Score   6 non-null      int64
 2   Team    6 non-null      object
 3   Age     6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [25]:
my_df.describe()

           Score      Age
count    6.00000   6.0000
mean    80.50000  35.5000
std     17.82975   4.1833
min     56.00000  30.0000
25%     68.25000  33.2500
50%     81.50000  35.0000
75%     95.50000  37.5000
max    100.00000  42.0000

In [26]:
my_df['Score']

0    100
1     65
2     78
3     56
4     85
5     99
Name: Score, dtype: int64

In [27]:
my_df[['Score','Team']]

   Score Team
0    100  RCB
1     65   MI
2     78  CSK
3     56   MI
4     85   RR
5     99  RCB

In [28]:
my_df

  Name  Score Team  Age
0   VK    100  RCB   36
1  SKY     65   MI   33
2  MSD     78  CSK   42
3   KP     56   MI   38
4   SS     85   RR   34
5   KL     99  RCB   30

In [29]:
my_df.at[5,'Team']='DD'

In [30]:
my_df

  Name  Score Team  Age
0   VK    100  RCB   36
1  SKY     65   MI   33
2  MSD     78  CSK   42
3   KP     56   MI   38
4   SS     85   RR   34
5   KL     99   DD   30

In [31]:
my_df.iat[4,2]='RPSG'

In [32]:
my_df

  Name  Score  Team  Age
0   VK    100   RCB   36
1  SKY     65    MI   33
2  MSD     78   CSK   42
3   KP     56    MI   38
4   SS     85  RPSG   34
5   KL     99    DD   30

In [33]:
my_df.iloc[[1,3,4,5]]

  Name  Score  Team  Age
1  SKY     65    MI   33
3   KP     56    MI   38
4   SS     85  RPSG   34
5   KL     99    DD   30

In [34]:
my_df.iloc[[1,3,4,5],[0,1]]

  Name  Score
1  SKY     65
3   KP     56
4   SS     85
5   KL     99

In [35]:
my_df.iloc[:,2]

0     RCB
1      MI
2     CSK
3      MI
4    RPSG
5      DD
Name: Team, dtype: object

In [36]:
my_df.iloc[:,[1,2]]

   Score  Team
0    100   RCB
1     65    MI
2     78   CSK
3     56    MI
4     85  RPSG
5     99    DD

In [37]:
my_df[['Score','Team']]

   Score  Team
0    100   RCB
1     65    MI
2     78   CSK
3     56    MI
4     85  RPSG
5     99    DD

In [38]:
my_df

  Name  Score  Team  Age
0   VK    100   RCB   36
1  SKY     65    MI   33
2  MSD     78   CSK   42
3   KP     56    MI   38
4   SS     85  RPSG   34
5   KL     99    DD   30

In [39]:
temp=my_df.drop([3,4],axis=0)
temp

  Name  Score Team  Age
0   VK    100  RCB   36
1  SKY     65   MI   33
2  MSD     78  CSK   42
5   KL     99   DD   30

In [40]:
temp.iloc[[0,1],[0,2,3]]

  Name Team  Age
0   VK  RCB   36
1  SKY   MI   33

In [49]:
x1=list(temp.columns)
# x1
x1[1]='Runs'
temp.columns=x1
temp

  Name  Runs Team  Age
0   VK   100  RCB   36
1  SKY    65   MI   33
2  MSD    78  CSK   42
5   KL    99   DD   30

In [50]:
my_df.drop('Age',axis=1)

  Name  Score  Team
0   VK    100   RCB
1  SKY     65    MI
2  MSD     78   CSK
3   KP     56    MI
4   SS     85  RPSG
5   KL     99    DD

In [51]:
my_df.drop(['Age','Score'],axis=1)

  Name  Team
0   VK   RCB
1  SKY    MI
2  MSD   CSK
3   KP    MI
4   SS  RPSG
5   KL    DD

In [73]:
my_df['New_Score']=my_df['Score']*0.1+10

In [74]:
my_df

  Name  Score  Team  Age  New_Score
0   VK    100   RCB   36       20.0
1  SKY     65    MI   33       16.5
2  MSD     78   CSK   42       17.8
3   KP     56    MI   38       15.6
4   SS     85  RPSG   34       18.5
5   KL     99    DD   30       19.9

In [72]:
# my_df=my_df.drop(['ABCD','New_Score'],axis=1)

In [76]:
type(my_df['New_Score'])

pandas.core.series.Series

In [77]:
# loc= indexing using labels
# iloc= indexing using index locations